In [1]:
'''
Numpy-Pandas-Basic-1 includes:
1.dictionary dataframes and series - what is column and index.
2.basic dataframe actions-head,tail,describe
3.import and export as dataset csv.
4.using np functions to create a DataFrame. (np.random.rand(r,c) | arange function for index.)
'''
import numpy as np
import pandas as pd

In [2]:
#1. Dictionary to DataFrame
dict1 = {
    "India":['mumbai','chennai','kolkata','jk'],
    "Pakistan":['baloch','sialkot','sindh','punjab'],
    "Points":[12,545,12,122]
}

df = pd.DataFrame(dict1)

In [3]:
df

     India Pakistan  Points
0   mumbai   baloch      12
1  chennai  sialkot     545
2  kolkata    sindh      12
3       jk   punjab     122

In [4]:
# Creating a Series (Combination of Series Creates a DataFrame)
ser= pd.Series(np.random.rand(5))

In [5]:
ser

0    0.477057
1    0.248305
2    0.865433
3    0.868382
4    0.427696
dtype: float64

In [6]:
#2. Basic DataFrame Functions
df.head(2)

     India Pakistan  Points
0   mumbai   baloch      12
1  chennai  sialkot     545

In [7]:
df.tail(3)

     India Pakistan  Points
1  chennai  sialkot     545
2  kolkata    sindh      12
3       jk   punjab     122

In [8]:
df.describe()

           Points
count    4.000000
mean   172.750000
std    253.526297
min     12.000000
25%     12.000000
50%     67.000000
75%    227.750000
max    545.000000

In [9]:
#3. Export to and Import from CSV
df.to_csv('exported.csv',index=0)

In [10]:
imported_df = pd.read_csv('imported.csv')

In [11]:
imported_df

               UK Netherlands  Points
0         bermuda     drenthe      56
1          london   flevoland      45
2  cayman islands     limburg    1322
3        scotland     holland     135

In [12]:
imported_df

               UK Netherlands  Points
0         bermuda     drenthe      56
1          london   flevoland      45
2  cayman islands     limburg    1322
3        scotland     holland     135

In [13]:
imported_df['Netherlands'][0]

'drenthe'

In [14]:
# 4. Creating a New DataFrame by Using Functions of Numpy Library.
new_df=pd.DataFrame(np.random.rand(5,5),index=np.arange(5),columns=np.arange(5))

In [15]:
new_df

          0         1         2         3         4
0  0.478893  0.325535  0.150960  0.429771  0.874719
1  0.909056  0.202683  0.267004  0.726947  0.528752
2  0.322416  0.302756  0.154624  0.343923  0.884472
3  0.523486  0.888582  0.954792  0.342540  0.781197
4  0.590453  0.851489  0.740074  0.575739  0.365720